---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToArea
source: html/32a4092d-e263-97e7-130b-7ef052ff23d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToArea Property

[Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTagNotInRoomToArea { get; }
```